Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType.IsValidApprovalTypeName(Autodesk.Revit.DB.Document,System.String)
Verifies if the provided approval name is unique in the document.
Returns:
True if approval type name is unique.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType.GetAllStructuralConnectionApprovalTypes(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId}@)
Collects the ids of all StructuralConnectionApprovalTypes in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new StructuralConnectionApprovalType.
name:
A name for the new approval type. It must be unique within the document.
Returns:
Created connection approval type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The input name for approval type is not unique in the document.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType
A type element that represents a connection approval type.
Since:
2017